UfkuAcik/FabGL-Studio-IDE/tools/project_cli/esp32_export.cpp
#include "esp32_export.h"

#include "esp32_capabilities.h"
#include "project_format.h"

#include <fabgl/assets/asset_pack.h>
#include <fabgl/assets/audio_importer.h>
#include <fabgl/assets/file_io.h>
#include <fabgl/assets/image_pipeline.h>
#include <fabgl/core/guid.h>
#include <fabgl/rendering/racer_track.h>
#include <fabgl/rendering/raycast_map_asset.h>
#include <fabgl/scene/scene.h>
#include <fabgl/serialization/scene_serializer.h>

#include <algorithm>
#include <cctype>
#include <cstdint>
#include <cstdlib>
#include <iomanip>
#include <limits>
#include <numeric>
#include <optional>
#include <set>
#include <sstream>
#include <string>
#include <string_view>
#include <system_error>
#include <utility>
#include <vector>

#ifdef _WIN32
#define WIN32_LEAN_AND_MEAN
#include <windows.h>
#else
#include <cerrno>
#include <dirent.h>
#include <sys/stat.h>
#include <unistd.h>
#endif

namespace fabgl::project {
namespace {

constexpr std::size_t MaximumAssetCount = 1024U;
constexpr std::size_t MaximumEmbeddedPayloadBytes = 2U * 1024U * 1024U;
constexpr std::size_t MaximumExternalPayloadBytes = 64U * 1024U * 1024U;
constexpr std::size_t MaximumTemplateBytes = 4U * 1024U * 1024U;

enum class NodeType { Missing, RegularFile, Directory, Link, Other };

struct SourceFile final {
    std::string relativePath;
    std::vector<std::uint8_t> bytes;
};

std::string normalizePath(std::string path) {
    std::replace(path.begin(), path.end(), '\\', '/');
    while (path.size() > 1U && path.back() == '/') {
#ifdef _WIN32
        if (path.size() == 3U && path[1] == ':')
            break;
#endif
        path.pop_back();
    }
    return path;
}

std::string joinPath(const std::string& left, const std::string& right) {
    if (left.empty())
        return normalizePath(right);
    if (right.empty())
        return normalizePath(left);
    return normalizePath(left + (left.back() == '/' || left.back() == '\\' ? "" : "/") + right);
}

std::string parentPath(const std::string& input) {
    const auto path = normalizePath(input);
    const auto separator = path.find_last_of('/');
    if (separator == std::string::npos)
        return ".";
    if (separator == 0U)
        return "/";
#ifdef _WIN32
    if (separator == 2U && path[1] == ':')
        return path.substr(0U, 3U);
#endif
    return path.substr(0U, separator);
}

std::string fileName(const std::string& input) {
    const auto path = normalizePath(input);
    const auto separator = path.find_last_of('/');
    return separator == std::string::npos ? path : path.substr(separator + 1U);
}

Error pathError(ErrorCode code, std::string message, const std::string& path,
                std::string detail = {}) {
    auto error = Error(code, std::move(message)).addContext("path", path);
    if (!detail.empty())
        error.addContext("filesystem", std::move(detail));
    return error;
}

#ifdef _WIN32

Result<std::wstring> toWide(std::string_view value) {
    if (value.find('\0') != std::string_view::npos) {
        return Result<std::wstring>::failure(
            Error(ErrorCode::InvalidArgument, "path contains NUL"));
    }
    if (value.size() > static_cast<std::size_t>(std::numeric_limits<int>::max())) {
        return Result<std::wstring>::failure(
            Error(ErrorCode::CapacityExceeded, "path is too long"));
    }
    const auto length = static_cast<int>(value.size());
    const auto count =
        MultiByteToWideChar(CP_UTF8, MB_ERR_INVALID_CHARS, value.data(), length, nullptr, 0);
    if (count <= 0) {
        return Result<std::wstring>::failure(
            Error(ErrorCode::InvalidArgument, "path is not valid UTF-8")
                .addContext("win32", std::to_string(GetLastError())));
    }
    std::wstring result(static_cast<std::size_t>(count), L'\0');
    if (MultiByteToWideChar(CP_UTF8, MB_ERR_INVALID_CHARS, value.data(), length, result.data(),
                            count) <= 0) {
        return Result<std::wstring>::failure(
            Error(ErrorCode::InvalidArgument, "path conversion failed")
                .addContext("win32", std::to_string(GetLastError())));
    }
    return Result<std::wstring>::success(std::move(result));
}

Result<std::string> fromWide(std::wstring_view value) {
    if (value.size() > static_cast<std::size_t>(std::numeric_limits<int>::max())) {
        return Result<std::string>::failure(Error(ErrorCode::CapacityExceeded, "path is too long"));
    }
    const auto length = static_cast<int>(value.size());
    const auto count =
        WideCharToMultiByte(CP_UTF8, 0, value.data(), length, nullptr, 0, nullptr, nullptr);
    if (count <= 0) {
        return Result<std::string>::failure(
            Error(ErrorCode::InvalidArgument, "filesystem path is not valid Unicode")
                .addContext("win32", std::to_string(GetLastError())));
    }
    std::string result(static_cast<std::size_t>(count), '\0');
    if (WideCharToMultiByte(CP_UTF8, 0, value.data(), length, result.data(), count, nullptr,
                            nullptr) <= 0) {
        return Result<std::string>::failure(
            Error(ErrorCode::InvalidArgument, "filesystem path conversion failed")
                .addContext("win32", std::to_string(GetLastError())));
    }
    return Result<std::string>::success(normalizePath(std::move(result)));
}

Result<std::string> absolutePath(const std::string& input) {
    auto wide = toWide(input);
    if (!wide)
        return Result<std::string>::failure(wide.error());
    const auto required = GetFullPathNameW(wide.value().c_str(), 0, nullptr, nullptr);
    if (required == 0U) {
        return Result<std::string>::failure(pathError(ErrorCode::IoError,
                                                      "unable to resolve absolute path", input,
                                                      std::to_string(GetLastError())));
    }
    std::wstring resolved(static_cast<std::size_t>(required), L'\0');
    const auto written = GetFullPathNameW(wide.value().c_str(), required, resolved.data(), nullptr);
    if (written == 0U || written >= required) {
        return Result<std::string>::failure(pathError(ErrorCode::IoError,
                                                      "unable to resolve absolute path", input,
                                                      std::to_string(GetLastError())));
    }
    resolved.resize(static_cast<std::size_t>(written));
    return fromWide(resolved);
}

Result<NodeType> inspectNode(const std::string& path) {
    auto wide = toWide(path);
    if (!wide)
        return Result<NodeType>::failure(wide.error());
    const auto attributes = GetFileAttributesW(wide.value().c_str());
    if (attributes == INVALID_FILE_ATTRIBUTES) {
        const auto code = GetLastError();
        if (code == ERROR_FILE_NOT_FOUND || code == ERROR_PATH_NOT_FOUND)
            return Result<NodeType>::success(NodeType::Missing);
        return Result<NodeType>::failure(pathError(
            ErrorCode::IoError, "unable to inspect filesystem entry", path, std::to_string(code)));
    }
    if ((attributes & FILE_ATTRIBUTE_REPARSE_POINT) != 0U)
        return Result<NodeType>::success(NodeType::Link);
    if ((attributes & FILE_ATTRIBUTE_DIRECTORY) != 0U)
        return Result<NodeType>::success(NodeType::Directory);
    if ((attributes & FILE_ATTRIBUTE_DEVICE) != 0U)
        return Result<NodeType>::success(NodeType::Other);
    return Result<NodeType>::success(NodeType::RegularFile);
}

