UfkuAcik/FabGL-Studio-IDE/tools/project_cli/esp32_export.cpp
Result<std::vector<std::string>> listDirectory(const std::string& path) {
    auto wide = toWide(joinPath(path, "*"));
    if (!wide)
        return Result<std::vector<std::string>>::failure(wide.error());
    WIN32_FIND_DATAW data{};
    const auto handle = FindFirstFileW(wide.value().c_str(), &data);
    if (handle == INVALID_HANDLE_VALUE) {
        return Result<std::vector<std::string>>::failure(
            pathError(ErrorCode::IoError, "unable to enumerate directory", path,
                      std::to_string(GetLastError())));
    }
    std::vector<std::string> names;
    for (;;) {
        const std::wstring_view name(data.cFileName);
        if (name != L"." && name != L"..") {
            auto encoded = fromWide(name);
            if (!encoded) {
                FindClose(handle);
                return Result<std::vector<std::string>>::failure(encoded.error());
            }
            names.push_back(std::move(encoded.value()));
        }
        if (FindNextFileW(handle, &data) == FALSE) {
            const auto code = GetLastError();
            FindClose(handle);
            if (code != ERROR_NO_MORE_FILES) {
                return Result<std::vector<std::string>>::failure(
                    pathError(ErrorCode::IoError, "directory enumeration failed", path,
                              std::to_string(code)));
            }
            break;
        }
    }
    return Result<std::vector<std::string>>::success(std::move(names));
}

Result<bool> createDirectoryExclusive(const std::string& path) {
    auto wide = toWide(path);
    if (!wide)
        return Result<bool>::failure(wide.error());
    if (CreateDirectoryW(wide.value().c_str(), nullptr) != FALSE)
        return Result<bool>::success(true);
    const auto code = GetLastError();
    if (code == ERROR_ALREADY_EXISTS)
        return Result<bool>::success(false);
    return Result<bool>::failure(
        pathError(ErrorCode::IoError, "unable to create directory", path, std::to_string(code)));
}

void removeFileNoThrow(const std::string& path) noexcept {
    auto wide = toWide(path);
    if (wide)
        DeleteFileW(wide.value().c_str());
}

void removeDirectoryNoThrow(const std::string& path) noexcept {
    auto wide = toWide(path);
    if (wide)
        RemoveDirectoryW(wide.value().c_str());
}

Result<void> renameDirectoryNoReplace(const std::string& source, const std::string& destination) {
    auto sourceWide = toWide(source);
    auto destinationWide = toWide(destination);
    if (!sourceWide)
        return Result<void>::failure(sourceWide.error());
    if (!destinationWide)
        return Result<void>::failure(destinationWide.error());
    DWORD code = ERROR_SUCCESS;
    for (auto attempt = 0; attempt < 24; ++attempt) {
        if (GetFileAttributesW(destinationWide.value().c_str()) != INVALID_FILE_ATTRIBUTES) {
            return Result<void>::failure(
                Error(ErrorCode::AlreadyExists, "refusing to overwrite an existing export path")
                    .addContext("path", destination));
        }
        if (MoveFileExW(sourceWide.value().c_str(), destinationWide.value().c_str(),
                        MOVEFILE_WRITE_THROUGH) != FALSE) {
            return Result<void>::success();
        }
        code = GetLastError();
        if (code != ERROR_ACCESS_DENIED && code != ERROR_SHARING_VIOLATION &&
            code != ERROR_LOCK_VIOLATION) {
            break;
        }
        Sleep(static_cast<DWORD>(std::min(250, 25 * (attempt + 1))));
    }
    return Result<void>::failure(pathError(ErrorCode::IoError, "unable to commit ESP32 export",
                                           destination, std::to_string(code)));
}

#else

Result<std::string> absolutePath(const std::string& input) {
    char* resolved = ::realpath(input.c_str(), nullptr);
    if (resolved == nullptr) {
        return Result<std::string>::failure(
            pathError(errno == ENOENT ? ErrorCode::NotFound : ErrorCode::IoError,
                      "unable to resolve absolute path", input, std::to_string(errno)));
    }
    std::string result(resolved);
    std::free(resolved);
    return Result<std::string>::success(normalizePath(std::move(result)));
}

Result<NodeType> inspectNode(const std::string& path) {
    struct stat status {};
    if (::lstat(path.c_str(), &status) != 0) {
        if (errno == ENOENT || errno == ENOTDIR)
            return Result<NodeType>::success(NodeType::Missing);
        return Result<NodeType>::failure(pathError(
            ErrorCode::IoError, "unable to inspect filesystem entry", path, std::to_string(errno)));
    }
    if (S_ISLNK(status.st_mode))
        return Result<NodeType>::success(NodeType::Link);
    if (S_ISREG(status.st_mode))
        return Result<NodeType>::success(NodeType::RegularFile);
    if (S_ISDIR(status.st_mode))
        return Result<NodeType>::success(NodeType::Directory);
    return Result<NodeType>::success(NodeType::Other);
}

Result<std::vector<std::string>> listDirectory(const std::string& path) {
    auto* directory = ::opendir(path.c_str());
    if (directory == nullptr) {
        return Result<std::vector<std::string>>::failure(pathError(
            ErrorCode::IoError, "unable to enumerate directory", path, std::to_string(errno)));
    }
    std::vector<std::string> names;
    errno = 0;
    while (const auto* entry = ::readdir(directory)) {
        const std::string name(entry->d_name);
        if (name != "." && name != "..")
            names.push_back(name);
        errno = 0;
    }
    const auto code = errno;
    ::closedir(directory);
    if (code != 0) {
        return Result<std::vector<std::string>>::failure(pathError(
            ErrorCode::IoError, "directory enumeration failed", path, std::to_string(code)));
    }
    return Result<std::vector<std::string>>::success(std::move(names));
}

Result<bool> createDirectoryExclusive(const std::string& path) {
    if (::mkdir(path.c_str(), 0755) == 0)
        return Result<bool>::success(true);
    if (errno == EEXIST)
        return Result<bool>::success(false);
    return Result<bool>::failure(
        pathError(ErrorCode::IoError, "unable to create directory", path, std::to_string(errno)));
}

void removeFileNoThrow(const std::string& path) noexcept {
    ::unlink(path.c_str());
}

void removeDirectoryNoThrow(const std::string& path) noexcept {
    ::rmdir(path.c_str());
}

Result<void> renameDirectoryNoReplace(const std::string& source, const std::string& destination) {
    auto destinationType = inspectNode(destination);
    if (!destinationType)
        return Result<void>::failure(destinationType.error());
    if (destinationType.value() != NodeType::Missing) {
        return Result<void>::failure(
            Error(ErrorCode::AlreadyExists, "refusing to overwrite an existing export path")
                .addContext("path", destination));
    }
    if (::rename(source.c_str(), destination.c_str()) != 0) {
        return Result<void>::failure(pathError(ErrorCode::IoError, "unable to commit ESP32 export",
                                               destination, std::to_string(errno)));
    }
    return Result<void>::success();
}

#endif

