UfkuAcik/FabGL-Studio-IDE/tools/project_cli/esp32_export.cpp
void removeTreeNoThrow(const std::string& root) noexcept {
    auto type = inspectNode(root);
    if (!type || type.value() == NodeType::Missing)
        return;
    if (type.value() != NodeType::Directory) {
        removeFileNoThrow(root);
        return;
    }
    auto children = listDirectory(root);
    if (children) {
        for (const auto& child : children.value())
            removeTreeNoThrow(joinPath(root, child));
    }
    removeDirectoryNoThrow(root);
}

class StagingGuard final {
  public:
    explicit StagingGuard(std::string path) : path_(std::move(path)) {}
    ~StagingGuard() {
        if (active_)
            removeTreeNoThrow(path_);
    }

    StagingGuard(const StagingGuard&) = delete;
    StagingGuard& operator=(const StagingGuard&) = delete;

    void release() noexcept {
        active_ = false;
    }

  private:
    std::string path_;
    bool active_ = true;
};

Result<std::string> canonicalNode(const std::string& input, NodeType expected,
                                  std::string_view description) {
    auto absolute = absolutePath(input);
    if (!absolute)
        return Result<std::string>::failure(absolute.error());
    auto type = inspectNode(absolute.value());
    if (!type)
        return Result<std::string>::failure(type.error());
    if (type.value() == NodeType::Missing) {
        return Result<std::string>::failure(pathError(
            ErrorCode::NotFound, std::string(description) + " was not found", absolute.value()));
    }
    if (type.value() == NodeType::Link) {
        return Result<std::string>::failure(
            pathError(ErrorCode::InvalidArgument,
                      std::string(description) + " cannot be a symbolic link", absolute.value()));
    }
    if (type.value() != expected) {
        return Result<std::string>::failure(pathError(
            ErrorCode::InvalidArgument, std::string(description) + " has the wrong filesystem type",
            absolute.value()));
    }
    return absolute;
}

std::string comparablePath(std::string path) {
    path = normalizePath(std::move(path));
#ifdef _WIN32
    std::transform(path.begin(), path.end(), path.begin(), [](unsigned char character) {
        return static_cast<char>(std::tolower(character));
    });
#endif
    return path;
}

bool isWithin(const std::string& root, const std::string& candidate) {
    const auto comparableRoot = comparablePath(root);
    const auto comparableCandidate = comparablePath(candidate);
    return comparableCandidate == comparableRoot ||
           (comparableCandidate.size() > comparableRoot.size() &&
            comparableCandidate.compare(0U, comparableRoot.size(), comparableRoot) == 0 &&
            comparableCandidate[comparableRoot.size()] == '/');
}

Result<std::string> resolveContainedFile(const std::string& root, const std::string& relativeInput,
                                         std::string_view description) {
    if (!assets::isSafeRelativePath(relativeInput)) {
        return Result<std::string>::failure(
            Error(ErrorCode::InvalidArgument, std::string(description) + " path is unsafe")
                .addContext("path", relativeInput));
    }
    const auto relative = normalizePath(relativeInput);
    std::string current = root;
    std::size_t start = 0;
    while (start < relative.size()) {
        const auto separator = relative.find('/', start);
        const auto segment = relative.substr(
            start, separator == std::string::npos ? std::string::npos : separator - start);
        current = joinPath(current, segment);
        auto type = inspectNode(current);
        if (!type)
            return Result<std::string>::failure(type.error());
        if (type.value() == NodeType::Link) {
            return Result<std::string>::failure(
                Error(ErrorCode::InvalidArgument,
                      std::string(description) + " path cannot contain symbolic links")
                    .addContext("path", relativeInput));
        }
        if (type.value() == NodeType::Missing) {
            return Result<std::string>::failure(pathError(
                ErrorCode::NotFound, std::string(description) + " was not found", current));
        }
        if (separator == std::string::npos)
            break;
        if (type.value() != NodeType::Directory) {
            return Result<std::string>::failure(
                pathError(ErrorCode::InvalidArgument,
                          std::string(description) + " path crosses a non-directory", current));
        }
        start = separator + 1U;
    }
    auto file = canonicalNode(current, NodeType::RegularFile, description);
    if (!file)
        return file;
    if (!isWithin(root, file.value())) {
        return Result<std::string>::failure(
            Error(ErrorCode::InvalidArgument,
                  std::string(description) + " resolves outside the project root")
                .addContext("path", relativeInput));
    }
    return file;
}

Result<void> enumerateFiles(const std::string& root, const std::string& relativeDirectory,
                            std::vector<std::pair<std::string, std::string>>& paths,
                            std::string_view description) {
    const auto directory = relativeDirectory.empty() ? root : joinPath(root, relativeDirectory);
    auto names = listDirectory(directory);
    if (!names)
        return Result<void>::failure(names.error());
    std::sort(names.value().begin(), names.value().end());
    for (const auto& name : names.value()) {
        const auto relative = relativeDirectory.empty() ? name : joinPath(relativeDirectory, name);
        if (!assets::isSafeRelativePath(relative)) {
            return Result<void>::failure(
                Error(ErrorCode::InvalidArgument,
                      std::string(description) + " contains an unsafe relative path")
                    .addContext("path", relative));
        }
        const auto fullPath = joinPath(root, relative);
        auto type = inspectNode(fullPath);
        if (!type)
            return Result<void>::failure(type.error());
        if (type.value() == NodeType::Link) {
            return Result<void>::failure(
                Error(ErrorCode::InvalidArgument,
                      std::string(description) + " cannot contain symbolic links")
                    .addContext("path", fullPath));
        }
        if (type.value() == NodeType::Directory) {
            auto nested = enumerateFiles(root, relative, paths, description);
            if (!nested)
                return nested;
        } else if (type.value() == NodeType::RegularFile) {
            paths.emplace_back(relative, fullPath);
            if (paths.size() > MaximumAssetCount) {
                return Result<void>::failure(
                    Error(ErrorCode::CapacityExceeded,
                          std::string(description) + " contains too many files")
                        .addContext("maximum", std::to_string(MaximumAssetCount)));
            }
        } else {
            return Result<void>::failure(
                Error(ErrorCode::InvalidArgument,
                      std::string(description) + " contains a non-regular filesystem entry")
                    .addContext("path", fullPath));
        }
    }
    return Result<void>::success();
}

Result<std::vector<SourceFile>> collectRegularFiles(const std::string& rootInput,
                                                    std::string_view description, bool allowMissing,
                                                    std::size_t maximumBytes) {
    auto type = inspectNode(rootInput);
    if (!type)
        return Result<std::vector<SourceFile>>::failure(type.error());
    if (type.value() == NodeType::Missing && allowMissing)
        return Result<std::vector<SourceFile>>::success({});
    if (type.value() == NodeType::Missing) {
        return Result<std::vector<SourceFile>>::failure(pathError(
            ErrorCode::NotFound, std::string(description) + " directory was not found", rootInput));
    }
    if (type.value() == NodeType::Link || type.value() != NodeType::Directory) {
        return Result<std::vector<SourceFile>>::failure(pathError(
            ErrorCode::InvalidArgument,
            std::string(description) + " must be a real directory, not a link", rootInput));
    }
    auto root = canonicalNode(rootInput, NodeType::Directory, description);
    if (!root)
        return Result<std::vector<SourceFile>>::failure(root.error());

    std::vector<std::pair<std::string, std::string>> paths;
    auto enumerated = enumerateFiles(root.value(), {}, paths, description);
    if (!enumerated)
        return Result<std::vector<SourceFile>>::failure(enumerated.error());
    std::sort(paths.begin(), paths.end(),
              [](const auto& lhs, const auto& rhs) { return lhs.first < rhs.first; });

    std::vector<SourceFile> files;
    files.reserve(paths.size());
    std::size_t totalBytes = 0;
    for (const auto& [relative, path] : paths) {
        auto bytes = assets::readBinaryFile(path);
        if (!bytes) {
            return Result<std::vector<SourceFile>>::failure(
                bytes.error()
                    .withContext("source", std::string(description))
                    .withContext("relative_path", relative));
        }
        if (bytes.value().size() > maximumBytes - std::min(totalBytes, maximumBytes)) {
            return Result<std::vector<SourceFile>>::failure(
                Error(ErrorCode::CapacityExceeded,
                      std::string(description) + " exceeds the embedded size limit")
                    .addContext("maximum_bytes", std::to_string(maximumBytes)));
        }
        totalBytes += bytes.value().size();
        files.push_back({relative, std::move(bytes.value())});
    }
    return Result<std::vector<SourceFile>>::success(std::move(files));
}

void appendU16(std::vector<std::uint8_t>& output, std::uint16_t value) {
    const auto wide = static_cast<std::uint32_t>(value);
    output.push_back(static_cast<std::uint8_t>(wide & 0xFFU));
    output.push_back(static_cast<std::uint8_t>((wide >> 8U) & 0xFFU));
}

Result<std::vector<std::uint8_t>> wrapAssetPayload(const SourceFile& asset) {
    const auto& embeddedPath = asset.relativePath;
    if (embeddedPath.size() > 65535U) {
        return Result<std::vector<std::uint8_t>>::failure(
            Error(ErrorCode::CapacityExceeded, "asset relative path is too long")
                .addContext("path", embeddedPath));
    }
    std::vector<std::uint8_t> payload;
    payload.reserve(8U + embeddedPath.size() + asset.bytes.size());
    payload.insert(payload.end(), {'F', 'G', 'L', 'A'});
    appendU16(payload, 1U);
    appendU16(payload, static_cast<std::uint16_t>(embeddedPath.size()));
    payload.insert(payload.end(), embeddedPath.begin(), embeddedPath.end());
    payload.insert(payload.end(), asset.bytes.begin(), asset.bytes.end());
    return Result<std::vector<std::uint8_t>>::success(std::move(payload));
}

bool validSketchName(std::string_view name) {
    if (name.empty() || name.size() > 63U)
        return false;
    const auto validInitial = [](unsigned char character) {
        return std::isalnum(character) != 0 || character == '_';
    };
    if (!validInitial(static_cast<unsigned char>(name.front())))
        return false;
    for (const auto character : name) {
        const auto byte = static_cast<unsigned char>(character);
        if (std::isalnum(byte) == 0 && character != '_' && character != '-')
            return false;
    }
    return true;
}

std::string lowercaseAscii(std::string value) {
    std::transform(value.begin(), value.end(), value.begin(), [](unsigned char character) {
        return static_cast<char>(std::tolower(character));
    });
    return value;
}

std::string cppStringLiteral(std::string_view value) {
    std::ostringstream output;
    output << '"';
    for (const auto character : value) {
        const auto byte = static_cast<unsigned char>(character);
        if (character == '"' || character == '\\') {
            output << '\\' << character;
        } else if (byte >= 0x20U && byte <= 0x7EU) {
            output << character;
        } else {
            const auto wide = static_cast<unsigned int>(byte);
            output << '\\' << static_cast<char>('0' + ((wide >> 6U) & 0x07U))
                   << static_cast<char>('0' + ((wide >> 3U) & 0x07U))
                   << static_cast<char>('0' + (wide & 0x07U));
        }
    }
    output << '"';
    return output.str();
}

std::string jsonStringLiteral(std::string_view value) {
    constexpr char HexDigits[] = "0123456789abcdef";
    std::ostringstream output;
    output << '"';
    for (const auto character : value) {
        const auto byte = static_cast<unsigned char>(character);
        switch (character) {
        case '"':
            output << "\\\"";
            break;
        case '\\':
            output << "\\\\";
            break;
        case '\b':
            output << "\\b";
            break;
        case '\f':
            output << "\\f";
            break;
        case '\n':
            output << "\\n";
            break;
        case '\r':
            output << "\\r";
            break;
        case '\t':
            output << "\\t";
            break;
        default:
            if (byte < 0x20U) {
                const auto wide = static_cast<unsigned int>(byte);
                output << "\\u00" << HexDigits[(wide >> 4U) & 0x0FU] << HexDigits[wide & 0x0FU];
            } else {
                output << character;
            }
            break;
        }
    }
    output << '"';
    return output.str();
}

std::string hexadecimal64(std::uint64_t value) {
    std::ostringstream output;
    output << "0x" << std::hex << std::setw(16) << std::setfill('0') << value;
    return output.str();
}

std::string generateExportResult(const Manifest& manifest, std::string_view sketchFileName,
                                 std::size_t entityCount, std::size_t assetCount,
                                 std::size_t portableScriptFileCount, const assets::AssetPack& pack,
                                 std::uint64_t payloadChecksum,
                                 const assets::AssetPack* externalPack,
                                 std::uint64_t externalPayloadChecksum) {
    std::ostringstream output;
    output << "{\n"
           << "  \"schemaVersion\": 1,\n"
           << "  \"kind\": \"FabGLStudioEsp32Export\",\n"
           << "  \"projectName\": " << jsonStringLiteral(manifest.name) << ",\n"
           << "  \"previewDemo\": " << jsonStringLiteral(manifest.previewDemo) << ",\n"
           << "  \"sketchFileName\": " << jsonStringLiteral(sketchFileName) << ",\n"
           << "  \"sceneFormatVersion\": " << SceneSerializer::CurrentVersion << ",\n"
           << "  \"entityCount\": " << entityCount << ",\n"
           << "  \"assetCount\": " << assetCount << ",\n"
           << "  \"portableScriptFileCount\": " << portableScriptFileCount << ",\n"
           << "  \"scriptRuntime\": " << (portableScriptFileCount == 0U ? "false" : "true") << ",\n"
           << "  \"payloadSize\": " << pack.bytes.size() << ",\n"
           << "  \"payloadChecksum\": " << jsonStringLiteral(hexadecimal64(payloadChecksum))
           << ",\n"
           << "  \"packBuildChecksum\": " << jsonStringLiteral(hexadecimal64(pack.buildChecksum))
           << ",\n  \"externalAssetCount\": "
           << (externalPack == nullptr ? 0U : externalPack->index.size())
           << ",\n  \"externalPayloadSize\": "
           << (externalPack == nullptr ? 0U : externalPack->bytes.size())
           << ",\n  \"externalPayloadChecksum\": "
           << jsonStringLiteral(hexadecimal64(externalPayloadChecksum))
           << ",\n  \"externalPackBuildChecksum\": "
           << jsonStringLiteral(hexadecimal64(externalPack == nullptr ? 0U
                                                                       : externalPack->buildChecksum))
           << "\n"
           << "}\n";
    return output.str();
}

std::string generatePayloadHeader(const Manifest& manifest, std::size_t entityCount,
                                  std::size_t assetCount, const assets::AssetPack& pack,
                                  std::uint64_t payloadChecksum,
                                  const assets::AssetPack* externalPack,
                                  std::uint64_t externalPayloadChecksum) {
    std::ostringstream output;
    output << "#pragma once\n\n"
              "#include <Arduino.h>\n\n"
              "namespace fabgl_project_payload {\n\n"
           << "static constexpr char kProjectName[] = " << cppStringLiteral(manifest.name) << ";\n"
           << "static constexpr char kPreviewDemo[] = " << cppStringLiteral(manifest.previewDemo)
           << ";\n"
           << "static constexpr uint32_t kEntityCount = " << entityCount << "U;\n"
           << "static constexpr uint32_t kAssetCount = " << assetCount << "U;\n"
           << "static constexpr uint64_t kPayloadChecksum = 0x" << std::hex << std::setw(16)
           << std::setfill('0') << payloadChecksum << "ULL;\n"
           << "static constexpr uint64_t kPackBuildChecksum = 0x" << std::setw(16)
           << pack.buildChecksum
           << "ULL;\n"
           << "static constexpr uint32_t kExternalAssetCount = " << std::dec
           << (externalPack == nullptr ? 0U : externalPack->index.size()) << "U;\n"
           << "static constexpr uint64_t kExternalPayloadChecksum = 0x" << std::hex
           << std::setw(16) << externalPayloadChecksum << "ULL;\n"
           << "static constexpr uint64_t kExternalPackBuildChecksum = 0x" << std::setw(16)
           << (externalPack == nullptr ? 0U : externalPack->buildChecksum)
           << "ULL;\n\n"
              "static const uint8_t kData[] PROGMEM = {";
    for (std::size_t index = 0; index < pack.bytes.size(); ++index) {
        if (index % 12U == 0U)
            output << "\n    ";
        output << "0x" << std::setw(2) << static_cast<unsigned int>(pack.bytes[index]);
        if (index + 1U != pack.bytes.size())
            output << ", ";
    }
    output << "\n};\n"
              "static constexpr size_t kPayloadSize = sizeof(kData);\n\n"
              "} // namespace fabgl_project_payload\n";
    return output.str();
}

Result<std::string> createStagingDirectory(const std::string& parent, std::string_view sketchName) {
    for (int attempt = 0; attempt < 4; ++attempt) {
        const auto staging =
            joinPath(parent, std::string(".fabgl-export-") + std::string(sketchName) + "-" +
                                 AssetGuid::generate().toString());
        auto created = createDirectoryExclusive(staging);
        if (!created)
            return Result<std::string>::failure(created.error());
        if (created.value())
            return Result<std::string>::success(staging);
    }
    return Result<std::string>::failure(
        Error(ErrorCode::AlreadyExists, "unable to allocate a unique export staging directory"));
}

