UfkuAcik/FabGL-Studio-IDE/tools/project_cli/esp32_export.cpp
Result<void> writeStagedFile(const std::string& staging, const SourceFile& file) {
    const auto target = joinPath(staging, file.relativePath);
    auto directories = assets::createDirectories(parentPath(target));
    if (!directories)
        return Result<void>::failure(directories.error());
    auto written = assets::writeBinaryFileAtomic(target, file.bytes);
    if (!written)
        return Result<void>::failure(
            written.error().withContext("relative_path", file.relativePath));
    return Result<void>::success();
}

Result<std::string> prepareOutputPath(const std::string& outputInput, std::string& sketchName) {
    const auto normalized = normalizePath(outputInput);
    sketchName = fileName(normalized);
    if (!validSketchName(sketchName)) {
        return Result<std::string>::failure(
            Error(ErrorCode::InvalidArgument,
                  "output folder must be a valid Arduino sketch name (A-Z, 0-9, _, -; max 63)")
                .addContext("name", sketchName));
    }
    auto parentCreated = assets::createDirectories(parentPath(normalized));
    if (!parentCreated)
        return Result<std::string>::failure(parentCreated.error());
    auto canonicalParent =
        canonicalNode(parentPath(normalized), NodeType::Directory, "export parent directory");
    if (!canonicalParent)
        return Result<std::string>::failure(canonicalParent.error());
    return Result<std::string>::success(joinPath(canonicalParent.value(), sketchName));
}

} // namespace

Result<std::vector<Esp32PortableScriptSource>>
collectEsp32PortableScriptSources(const std::string& projectRootDirectory) {
    auto projectRoot = canonicalNode(projectRootDirectory, NodeType::Directory, "project root");
    if (!projectRoot)
        return Result<std::vector<Esp32PortableScriptSource>>::failure(projectRoot.error());

    auto scriptFiles = collectRegularFiles(joinPath(projectRoot.value(), "Scripts"), "Scripts",
                                           true, MaximumTemplateBytes);
    if (!scriptFiles)
        return Result<std::vector<Esp32PortableScriptSource>>::failure(scriptFiles.error());

    std::vector<Esp32PortableScriptSource> portableScripts;
    bool hasDesktopGameplaySource = false;
    bool hasPortableModuleEntry = false;
    for (auto& script : scriptFiles.value()) {
        const auto path = lowercaseAscii(script.relativePath);
        const auto separator = path.find_last_of('.');
        const auto extension =
            separator == std::string::npos ? std::string() : path.substr(separator);
        const bool cFamily = extension == ".c" || extension == ".cc" || extension == ".cpp" ||
                             extension == ".cxx" || extension == ".h" || extension == ".hh" ||
                             extension == ".hpp" || extension == ".hxx" || extension == ".ino";
        if (!cFamily)
            continue;
        const bool portable = path.rfind("esp32/", 0U) == 0U;
        if (!portable) {
            hasDesktopGameplaySource = true;
            continue;
        }
        if (extension == ".ino" || script.relativePath.size() <= 6U) {
            return Result<std::vector<Esp32PortableScriptSource>>::failure(
                Error(ErrorCode::InvalidArgument,
                      "portable ESP32 scripts must be C/C++ sources or headers, not sketches")
                    .addContext("path", std::string("Scripts/") + script.relativePath));
        }
        const std::string sourceText(script.bytes.begin(), script.bytes.end());
        hasPortableModuleEntry =
            hasPortableModuleEntry ||
            sourceText.find("fabglProjectGetEsp32ScriptsV1") != std::string::npos ||
            sourceText.find("FGL_ESP32_SCRIPT_MODULE") != std::string::npos;
        portableScripts.push_back({std::move(script.relativePath), std::move(script.bytes)});
    }
    if (hasDesktopGameplaySource && portableScripts.empty()) {
        return Result<std::vector<Esp32PortableScriptSource>>::failure(
            Error(ErrorCode::InvalidState,
                  "desktop gameplay scripts require a portable Scripts/ESP32 module for ESP32 "
                  "export"));
    }
    if (!portableScripts.empty() && !hasPortableModuleEntry) {
        return Result<std::vector<Esp32PortableScriptSource>>::failure(
            Error(ErrorCode::InvalidFormat,
                  "portable ESP32 scripts do not export fabglProjectGetEsp32ScriptsV1"));
    }
    return Result<std::vector<Esp32PortableScriptSource>>::success(std::move(portableScripts));
}

Result<Esp32ExportSummary> exportEsp32Project(const std::string& projectManifestPath,
                                              const std::string& firmwareTemplateDirectory,
                                              const std::string& outputSketchDirectory) {
    auto projectFile =
        canonicalNode(projectManifestPath, NodeType::RegularFile, "project manifest");
    if (!projectFile)
        return Result<Esp32ExportSummary>::failure(projectFile.error());
    auto projectRoot =
        canonicalNode(parentPath(projectFile.value()), NodeType::Directory, "project root");
    if (!projectRoot)
        return Result<Esp32ExportSummary>::failure(projectRoot.error());

    auto manifestSource = assets::readTextFile(projectFile.value());
    if (!manifestSource)
        return Result<Esp32ExportSummary>::failure(manifestSource.error());
    auto manifest = parseManifest(manifestSource.value());
    if (!manifest) {
        return Result<Esp32ExportSummary>::failure(
            manifest.error().withContext("path", projectFile.value()));
    }
    const std::string legacyAssetIndex = ".fabglstudio/asset-index-v1.json";
    auto legacyType = inspectNode(joinPath(projectRoot.value(), legacyAssetIndex));
    if (!legacyType)
        return Result<Esp32ExportSummary>::failure(legacyType.error());
    if (legacyType.value() != NodeType::Missing) {
        auto legacyPath =
            resolveContainedFile(projectRoot.value(), legacyAssetIndex, "legacy asset index");
        if (!legacyPath)
            return Result<Esp32ExportSummary>::failure(legacyPath.error());
        auto legacySource = assets::readTextFile(legacyPath.value());
        if (!legacySource)
            return Result<Esp32ExportSummary>::failure(legacySource.error());
        auto migrated = mergeLegacyAssetIndex(legacySource.value(), manifest.value());
        if (!migrated) {
            return Result<Esp32ExportSummary>::failure(
                migrated.error().withContext("path", legacyPath.value()));
        }
    }
    if (manifest.value().sourceVersion != Manifest::CurrentVersion) {
        manifest.value().sourceVersion = Manifest::CurrentVersion;
        manifest.value().projectGuid =
            AssetGuid::fromStableName("legacy-project:" + manifest.value().name).toString();
    }
    auto canonicalManifest = serializeManifest(manifest.value());
    if (!canonicalManifest)
        return Result<Esp32ExportSummary>::failure(canonicalManifest.error());

    auto sceneFile =
        resolveContainedFile(projectRoot.value(), manifest.value().startupScene, "startup scene");
    if (!sceneFile)
        return Result<Esp32ExportSummary>::failure(sceneFile.error());
    auto sceneSource = assets::readTextFile(sceneFile.value());
    if (!sceneSource)
        return Result<Esp32ExportSummary>::failure(sceneSource.error());
    auto scene = SceneSerializer::deserialize(sceneSource.value());
    if (!scene) {
        return Result<Esp32ExportSummary>::failure(
            scene.error().withContext("path", sceneFile.value()));
    }
    auto capabilities = validateEsp32TargetCapabilities(manifest.value(), *scene.value());
    if (!capabilities) {
        return Result<Esp32ExportSummary>::failure(
            capabilities.error().withContext("scene_path", sceneFile.value()));
    }
    auto canonicalScene = SceneSerializer::serialize(*scene.value());
    if (!canonicalScene)
        return Result<Esp32ExportSummary>::failure(canonicalScene.error());

    auto assetFiles = collectRegularFiles(joinPath(projectRoot.value(), "Assets"), "Assets", true,
                                          MaximumExternalPayloadBytes);
    if (!assetFiles)
        return Result<Esp32ExportSummary>::failure(assetFiles.error());
    auto collectedScripts = collectEsp32PortableScriptSources(projectRoot.value());
    if (!collectedScripts)
        return Result<Esp32ExportSummary>::failure(collectedScripts.error());
    std::vector<SourceFile> portableScriptFiles;
    portableScriptFiles.reserve(collectedScripts.value().size());
    for (auto& script : collectedScripts.value()) {
        portableScriptFiles.push_back(
            {std::string("src/ProjectScripts/") + script.relativePath.substr(6U),
             std::move(script.bytes)});
    }

    struct EmbeddedAsset final {
        AssetGuid guid;
        SourceFile file;
        assets::StorageClass storage = assets::StorageClass::Flash;
    };
    std::vector<EmbeddedAsset> embeddedAssets;
    embeddedAssets.reserve(manifest.value().assets.size() + assetFiles.value().size());
    std::set<std::string> embeddedPaths;
    for (const auto& declared : manifest.value().assets) {
        auto source = resolveContainedFile(projectRoot.value(), declared.path, "project asset");
        if (!source)
            return Result<Esp32ExportSummary>::failure(source.error());
        auto bytes = assets::readBinaryFile(source.value());
        if (!bytes)
            return Result<Esp32ExportSummary>::failure(bytes.error());
        const auto normalizedPath = lowercaseAscii(declared.path);
        const auto dot = normalizedPath.find_last_of('.');
        const auto extension =
            dot == std::string::npos ? std::string{} : normalizedPath.substr(dot);
        if (extension == ".png" || extension == ".jpg" || extension == ".jpeg" ||
            extension == ".bmp") {
            auto settings = decodeProjectImageImportSettings(declared.importSettings);
            if (!settings)
                return Result<Esp32ExportSummary>::failure(settings.error());
            auto image = assets::loadImage(source.value());
            if (!image)
                return Result<Esp32ExportSummary>::failure(image.error());
            auto compiled = assets::compileImageAsset(image.value(), settings.value());
            if (!compiled)
                return Result<Esp32ExportSummary>::failure(compiled.error());
            bytes.value() = std::move(compiled.value().payload);
        } else if (extension == ".wav") {
            auto settings = decodeProjectAudioImportSettings(declared.importSettings);
            if (!settings)
                return Result<Esp32ExportSummary>::failure(settings.error());
            auto audio = assets::importWav(bytes.value(), settings.value().settings);
            if (!audio)
                return Result<Esp32ExportSummary>::failure(audio.error());
            bytes.value() = assets::encodeAudioClip(audio.value(), settings.value().encoding);
        }
        if (declared.type == "image") {
            auto image = assets::decodeIndexedImage(bytes.value());
            if (!image) {
                return Result<Esp32ExportSummary>::failure(
                    image.error().withContext("asset", declared.path));
            }
            if (image.value().width > 512 || image.value().height > 512) {
                return Result<Esp32ExportSummary>::failure(
                    Error(ErrorCode::CapacityExceeded,
                          "indexed image exceeds the ESP32 runtime dimension limit")
                        .addContext("asset", declared.path)
                        .addContext("width", std::to_string(image.value().width))
                        .addContext("height", std::to_string(image.value().height))
                        .addContext("maximum", "512"));
            }
        } else if (declared.type == "raycast.map") {
            const std::string text(bytes.value().begin(), bytes.value().end());
            auto map = rendering::deserializeRaycastMapAsset(text);
            if (!map) {
                return Result<Esp32ExportSummary>::failure(
                    map.error().withContext("asset", declared.path));
            }
            if (map.value().guid != declared.guid) {
                return Result<Esp32ExportSummary>::failure(
                    Error(ErrorCode::TypeMismatch, "raycast map GUID does not match its manifest")
                        .addContext("asset", declared.path)
                        .addContext("declared_guid", declared.guid.toString())
                        .addContext("content_guid", map.value().guid.toString()));
            }
            if (map.value().map.width > 32 || map.value().map.height > 32 ||
                map.value().map.wallPalette.size() > 32U) {
                return Result<Esp32ExportSummary>::failure(
                    Error(ErrorCode::CapacityExceeded,
                          "raycast map exceeds the ESP32 runtime map limits")
                        .addContext("asset", declared.path)
                        .addContext("width", std::to_string(map.value().map.width))
                        .addContext("height", std::to_string(map.value().map.height))
                        .addContext("palette_colors",
                                    std::to_string(map.value().map.wallPalette.size()))
                        .addContext("maximum_dimensions", "32x32")
                        .addContext("maximum_palette_colors", "32"));
            }
        } else if (declared.type == "racer.track") {
            const std::string text(bytes.value().begin(), bytes.value().end());
            auto track = rendering::deserializeRacerTrack(text);
            if (!track) {
                return Result<Esp32ExportSummary>::failure(
                    track.error().withContext("asset", declared.path));
            }
            if (track.value().guid != declared.guid) {
                return Result<Esp32ExportSummary>::failure(
                    Error(ErrorCode::TypeMismatch, "racer track GUID does not match its manifest")
                        .addContext("asset", declared.path)
                        .addContext("declared_guid", declared.guid.toString())
                        .addContext("content_guid", track.value().guid.toString()));
            }
            if (track.value().segments.size() > 256U) {
                return Result<Esp32ExportSummary>::failure(
                    Error(ErrorCode::CapacityExceeded,
                          "racer track exceeds the ESP32 runtime segment limit")
                        .addContext("asset", declared.path)
                        .addContext("segments", std::to_string(track.value().segments.size()))
                        .addContext("maximum", "256"));
            }
        }
        if (!embeddedPaths.insert(lowercaseAscii(declared.path)).second) {
            return Result<Esp32ExportSummary>::failure(
                Error(ErrorCode::AlreadyExists, "ESP32 asset paths must be unique")
                    .addContext("path", declared.path));
        }
        const auto storage =
            declared.esp32Target == assets::AssetTarget::Esp32Psram ? assets::StorageClass::Psram
            : declared.esp32Target == assets::AssetTarget::Esp32Sd  ? assets::StorageClass::Sd
                                                                    : assets::StorageClass::Flash;
        embeddedAssets.push_back(
            {declared.guid, {declared.path, std::move(bytes.value())}, storage});
    }
    for (auto& asset : assetFiles.value()) {
        asset.relativePath = std::string("Assets/") + asset.relativePath;
        if (!embeddedPaths.insert(lowercaseAscii(asset.relativePath)).second)
            continue;
        embeddedAssets.push_back(
            {AssetGuid::fromStableName("fabgl.esp32-export.asset:" + manifest.value().projectGuid +
                                       ":" + asset.relativePath),
             std::move(asset), assets::StorageClass::Flash});
    }
    if (embeddedAssets.size() > Esp32MaximumEmbeddedAssets) {
        return Result<Esp32ExportSummary>::failure(
            Error(ErrorCode::CapacityExceeded, "project contains too many ESP32 runtime assets")
                .addContext("maximum", std::to_string(Esp32MaximumEmbeddedAssets)));
    }

    std::vector<assets::PackInput> packInputs;
    std::vector<assets::PackInput> externalPackInputs;
    packInputs.reserve(2U + embeddedAssets.size());
    externalPackInputs.reserve(embeddedAssets.size());
    packInputs.push_back(
        {AssetGuid::fromStableName("fabgl.esp32-export.manifest:" + manifest.value().projectGuid),
         Esp32ManifestPayloadType, assets::StorageClass::Flash,
         std::vector<std::uint8_t>(canonicalManifest.value().begin(),
                                   canonicalManifest.value().end())});
    packInputs.push_back(
        {AssetGuid::fromStableName("fabgl.esp32-export.scene:" + manifest.value().projectGuid +
                                   ":" + manifest.value().startupScene),
         Esp32ScenePayloadType, assets::StorageClass::Flash,
         std::vector<std::uint8_t>(canonicalScene.value().begin(), canonicalScene.value().end())});
    std::size_t sourcePayloadBytes =
        canonicalManifest.value().size() + canonicalScene.value().size();
    for (const auto& asset : embeddedAssets) {
        auto wrapped = wrapAssetPayload(asset.file);
        if (!wrapped)
            return Result<Esp32ExportSummary>::failure(wrapped.error());
        if (asset.storage == assets::StorageClass::Sd) {
            if (wrapped.value().size() >
                MaximumExternalPayloadBytes -
                    std::min<std::size_t>(MaximumExternalPayloadBytes,
                                          std::accumulate(
                                              externalPackInputs.begin(), externalPackInputs.end(),
                                              std::size_t{0U}, [](const std::size_t total,
                                                                 const assets::PackInput& input) {
                                                  return total + input.payload.size();
                                              }))) {
                return Result<Esp32ExportSummary>::failure(
                    Error(ErrorCode::CapacityExceeded,
                          "external ESP32 SD asset payload exceeds its bounded export limit")
                        .addContext("maximum_bytes",
                                    std::to_string(MaximumExternalPayloadBytes)));
            }
            externalPackInputs.push_back(
                {asset.guid, Esp32AssetPayloadType, assets::StorageClass::Sd,
                 std::move(wrapped.value())});
            SourceFile placeholder{asset.file.relativePath, {}};
            auto envelope = wrapAssetPayload(placeholder);
            if (!envelope)
                return Result<Esp32ExportSummary>::failure(envelope.error());
            if (envelope.value().size() >
                MaximumEmbeddedPayloadBytes -
                    std::min(sourcePayloadBytes, MaximumEmbeddedPayloadBytes)) {
                return Result<Esp32ExportSummary>::failure(
                    Error(ErrorCode::CapacityExceeded,
                          "project SD placeholders exceed the ESP32 embed limit")
                        .addContext("maximum_bytes",
                                    std::to_string(MaximumEmbeddedPayloadBytes)));
            }
            sourcePayloadBytes += envelope.value().size();
            packInputs.push_back({asset.guid, Esp32AssetPayloadType, assets::StorageClass::Sd,
                                  std::move(envelope.value())});
            continue;
        }
        if (wrapped.value().size() >
            MaximumEmbeddedPayloadBytes -
                std::min(sourcePayloadBytes, MaximumEmbeddedPayloadBytes)) {
            return Result<Esp32ExportSummary>::failure(
                Error(ErrorCode::CapacityExceeded, "project payload exceeds the ESP32 embed limit")
                    .addContext("maximum_bytes", std::to_string(MaximumEmbeddedPayloadBytes)));
        }
        sourcePayloadBytes += wrapped.value().size();
        packInputs.push_back(
            {asset.guid, Esp32AssetPayloadType, asset.storage, std::move(wrapped.value())});
    }
    auto pack = assets::buildPack(std::move(packInputs));
    if (!pack)
        return Result<Esp32ExportSummary>::failure(pack.error());
    if (pack.value().bytes.size() > MaximumEmbeddedPayloadBytes) {
        return Result<Esp32ExportSummary>::failure(
            Error(ErrorCode::CapacityExceeded, "packed project exceeds the ESP32 embed limit")
                .addContext("maximum_bytes", std::to_string(MaximumEmbeddedPayloadBytes)));
    }
    const auto payloadChecksum =
        assets::checksum64(pack.value().bytes.data(), pack.value().bytes.size());
    assets::AssetPack externalPack;
    const assets::AssetPack* externalPackView = nullptr;
    std::uint64_t externalPayloadChecksum = 0U;
    if (!externalPackInputs.empty()) {
        auto packedExternal = assets::buildPack(std::move(externalPackInputs));
        if (!packedExternal)
            return Result<Esp32ExportSummary>::failure(packedExternal.error());
        if (packedExternal.value().bytes.size() > MaximumExternalPayloadBytes) {
            return Result<Esp32ExportSummary>::failure(
                Error(ErrorCode::CapacityExceeded, "external ESP32 SD pack exceeds its limit")
                    .addContext("maximum_bytes", std::to_string(MaximumExternalPayloadBytes)));
        }
        externalPack = std::move(packedExternal.value());
        externalPayloadChecksum =
            assets::checksum64(externalPack.bytes.data(), externalPack.bytes.size());
        externalPackView = &externalPack;
    }

    std::string sketchName;
    auto output = prepareOutputPath(outputSketchDirectory, sketchName);
    if (!output)
        return Result<Esp32ExportSummary>::failure(output.error());
    auto outputType = inspectNode(output.value());
    if (!outputType)
        return Result<Esp32ExportSummary>::failure(outputType.error());
    if (outputType.value() != NodeType::Missing) {
        return Result<Esp32ExportSummary>::failure(
            Error(ErrorCode::AlreadyExists, "refusing to overwrite an existing export path")
                .addContext("path", output.value()));
    }

    auto templateRoot =
        canonicalNode(firmwareTemplateDirectory, NodeType::Directory, "firmware template");
    if (!templateRoot)
        return Result<Esp32ExportSummary>::failure(templateRoot.error());
    auto templateFiles =
        collectRegularFiles(templateRoot.value(), "firmware template", false, MaximumTemplateBytes);
    if (!templateFiles)
        return Result<Esp32ExportSummary>::failure(templateFiles.error());
    std::optional<SourceFile> sharedLifecycleHeader;
    const auto sharedLifecyclePath = joinPath(
        parentPath(parentPath(templateRoot.value())), "common/LifecycleScheduler.h");
    auto sharedLifecycleType = inspectNode(sharedLifecyclePath);
    if (!sharedLifecycleType)
        return Result<Esp32ExportSummary>::failure(sharedLifecycleType.error());
    if (sharedLifecycleType.value() == NodeType::RegularFile) {
        auto bytes = assets::readBinaryFile(sharedLifecyclePath);
        if (!bytes)
            return Result<Esp32ExportSummary>::failure(bytes.error());
        if (bytes.value().size() > MaximumTemplateBytes) {
            return Result<Esp32ExportSummary>::failure(
                Error(ErrorCode::CapacityExceeded, "shared lifecycle header is too large"));
        }
        sharedLifecycleHeader = SourceFile{"LifecycleScheduler.h", std::move(bytes.value())};
    }

