UfkuAcik/FabGL-Studio-IDE/tools/project_cli/esp32_export.cpp
    bool hasBoardProfile = false;
    bool hasFirmwareSketch = false;
    std::set<std::string> stagedNames;
    std::vector<SourceFile> stagedFiles;
    stagedFiles.reserve(templateFiles.value().size() + portableScriptFiles.size() + 5U);
    for (auto& file : templateFiles.value()) {
        const auto lower = lowercaseAscii(file.relativePath);
        if (lower == "projectpayload.h" || lower == "projectpayload.fglpak" ||
            lower == "projectassets.fglpak" ||
            lower == "projectscriptconfig.h" || lower == "exportresult.json") {
            return Result<Esp32ExportSummary>::failure(
                Error(ErrorCode::AlreadyExists,
                      "firmware template uses a reserved generated payload filename")
                    .addContext("path", file.relativePath));
        }
        if (file.relativePath == "BoardProfile.h")
            hasBoardProfile = true;
        if (file.relativePath == "firmware.ino") {
            hasFirmwareSketch = true;
            file.relativePath = sketchName + ".ino";
        }
        const auto stagingKey = lowercaseAscii(file.relativePath);
        if (!stagedNames.insert(stagingKey).second) {
            return Result<Esp32ExportSummary>::failure(
                Error(ErrorCode::AlreadyExists, "firmware template creates duplicate output files")
                    .addContext("path", file.relativePath));
        }
        stagedFiles.push_back(std::move(file));
    }
    if (sharedLifecycleHeader) {
        const auto key = lowercaseAscii(sharedLifecycleHeader->relativePath);
        if (!stagedNames.insert(key).second) {
            return Result<Esp32ExportSummary>::failure(
                Error(ErrorCode::AlreadyExists,
                      "firmware template duplicates the shared lifecycle header"));
        }
        stagedFiles.push_back(std::move(*sharedLifecycleHeader));
    }
    if (!hasBoardProfile || !hasFirmwareSketch) {
        return Result<Esp32ExportSummary>::failure(Error(
            ErrorCode::NotFound, "firmware template must contain BoardProfile.h and firmware.ino"));
    }

    const auto header = generatePayloadHeader(
        manifest.value(), scene.value()->entityCount(), embeddedAssets.size(), pack.value(),
        payloadChecksum, externalPackView, externalPayloadChecksum);
    stagedFiles.push_back(
        SourceFile{"ProjectPayload.h", std::vector<std::uint8_t>(header.begin(), header.end())});
    stagedFiles.push_back(SourceFile{"ProjectPayload.fglpak", pack.value().bytes});
    if (externalPackView != nullptr)
        stagedFiles.push_back(SourceFile{"ProjectAssets.fglpak", externalPack.bytes});
    const auto scriptConfig =
        std::string("#pragma once\n\n#define FABGL_STUDIO_HAS_PROJECT_SCRIPTS ") +
        (portableScriptFiles.empty() ? "0\n" : "1\n") +
        "#define FABGL_STUDIO_PROJECT_SCRIPT_FILE_COUNT " +
        std::to_string(portableScriptFiles.size()) + "U\n";
    stagedFiles.push_back(
        SourceFile{"ProjectScriptConfig.h",
                   std::vector<std::uint8_t>(scriptConfig.begin(), scriptConfig.end())});
    const auto portableScriptFileCount = portableScriptFiles.size();
    if (portableScriptFileCount != 0U) {
        const std::string forwardingHeader =
            "#pragma once\n\n#include \"../../ProjectScriptRuntime.h\"\n";
        stagedFiles.push_back(SourceFile{
            "src/ProjectScripts/ProjectScriptRuntime.h",
            std::vector<std::uint8_t>(forwardingHeader.begin(), forwardingHeader.end())});
        stagedNames.insert("src/projectscripts/projectscriptruntime.h");
    }
    for (auto& script : portableScriptFiles) {
        const auto stagingKey = lowercaseAscii(script.relativePath);
        if (!stagedNames.insert(stagingKey).second) {
            return Result<Esp32ExportSummary>::failure(
                Error(ErrorCode::AlreadyExists,
                      "portable script creates a duplicate staged filename")
                    .addContext("path", script.relativePath));
        }
        stagedFiles.push_back(std::move(script));
    }
    const auto exportResult = generateExportResult(
        manifest.value(), sketchName + ".ino", scene.value()->entityCount(), embeddedAssets.size(),
        portableScriptFileCount, pack.value(), payloadChecksum, externalPackView,
        externalPayloadChecksum);
    stagedFiles.push_back(SourceFile{
        "ExportResult.json", std::vector<std::uint8_t>(exportResult.begin(), exportResult.end())});
    std::sort(stagedFiles.begin(), stagedFiles.end(),
              [](const auto& lhs, const auto& rhs) { return lhs.relativePath < rhs.relativePath; });

    auto staging = createStagingDirectory(parentPath(output.value()), sketchName);
    if (!staging)
        return Result<Esp32ExportSummary>::failure(staging.error());
    StagingGuard stagingGuard(staging.value());
    for (const auto& file : stagedFiles) {
        auto written = writeStagedFile(staging.value(), file);
        if (!written)
            return Result<Esp32ExportSummary>::failure(written.error());
    }
    auto committed = renameDirectoryNoReplace(staging.value(), output.value());
    if (!committed)
        return Result<Esp32ExportSummary>::failure(committed.error());
    stagingGuard.release();

    Esp32ExportSummary summary;
    summary.projectName = manifest.value().name;
    summary.previewDemo = manifest.value().previewDemo;
    summary.sketchFileName = sketchName + ".ino";
    summary.entityCount = scene.value()->entityCount();
    summary.assetCount = embeddedAssets.size();
    summary.portableScriptFileCount = portableScriptFileCount;
    summary.scriptRuntime = portableScriptFileCount != 0U;
    summary.payloadSize = pack.value().bytes.size();
    summary.payloadChecksum = payloadChecksum;
    summary.packBuildChecksum = pack.value().buildChecksum;
    summary.externalAssetCount = externalPackView == nullptr ? 0U : externalPack.index.size();
    summary.externalPayloadSize =
        externalPackView == nullptr ? 0U : externalPack.bytes.size();
    summary.externalPayloadChecksum = externalPayloadChecksum;
    summary.externalPackBuildChecksum =
        externalPackView == nullptr ? 0U : externalPack.buildChecksum;
    return Result<Esp32ExportSummary>::success(std::move(summary));
}

} // namespace fabgl::project
